# hyrpland criticals
archlinux-xdg-menu
hyprpolkitagent
bluez
bluez-utils


# hyprland rice
blueman
fastfetch
impala
ttf-firacode-nerd
noto-fonts-emoji
rofi-wayland
swaylock
swww
waybar
wiremix

# core
wl-clipboard
fzf
ghostty
git
neovim
btop
starship
vivaldi
zoxide
zsh
zsh-completions

# utilities 
eza
github-cli
lazygit
mise
unzip
yazi

# comms
discord

# commercial / paid packages
spotify-launcher

# required for others
fd
ffmpegthumbs
gcc
kdegraphics-thumbnailers
ripgrep
sddm
qt5-graphicaleffects
qt5-svg
qt5-quickcontrols2

